# 1. Which location has the maximum number of purchases been made?

In [ ]:
#Let's creat a sorted list of each location by their occurences 
cut -f 5 bank_transactions.tsv | sort | uniq -c | sort -nr > ordered_list

#Then we get the first row, which is the location that has the maximum number of purchases been made
echo The location that has the maximum number of purchases been made is $(head -n 1 ordered_list | sed 's/[^A-Z]*//g')

#Let's delete the ordered_list
rm ordered_list

# 2. In the dataset provided, did females spend more than males, or vice versa?

In [ ]:
#Let's get the rows that contain 'M' and let's sum all the CustAccountBalance
echo Males have spent $( cut -f 4,6 bank_transactions.tsv | grep 'M' | awk '{total += $2}END{print total}')

#Let's get the rows that contain 'F' and let's sum all the CustAccountBalance
echo Females have spent $( cut -f 4,6 bank_transactions.tsv | grep 'F' | awk '{total += $2}END{print total}')

# 3. Report the customer with the highest average transaction amount in the dataset.

In [ ]:
#To do

# Check results

In [25]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('bank_transactions.tsv', sep='\t')

In [6]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5

## 1. Which location has the maximum number of purchases been made?

In [17]:
print(df[['CustLocation','CustAccountBalance']].groupby('CustLocation').count().sort_values(by='CustAccountBalance', ascending=False).head(1).index[0])

MUMBAI

## 2. In the dataset provided, did females spend more than males, or vice versa?

In [37]:
print('Males have spent ','{:,f}'.format(df[df.CustGender == 'M'].CustAccountBalance.sum()))
print('')
print('Females have spent ','{:,f}'.format(df[df.CustGender == 'F'].CustAccountBalance.sum()))

Males have spent  89,819,734,670.069992

Females have spent  30,883,555,291.419994